Revit 2025 API
BooleanOperationsType Enumeration
 An enumerated type listing boolean types that are supported for boolean operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BooleanOperationsType
Public Enumeration BooleanOperationsType
public enum class BooleanOperationsType
type BooleanOperationsType
Members
Member name | Value | Description
Union | 0 |  Union.
Difference | 1 |  Difference.
Intersect | 2 |  Intersect.
See Also
Reference
Autodesk.Revit.DB Namespace